[
{"lines": ["KOCHI: In a tragic incident, three of a family including two women and a toddler drowned when the car they were travelling plunged into a canal at ", ", ", ", near here on Saturday late night.\n \n", "Belby, son of Sebastian, who was driving the car, managed to swim ashore while his wife Honey (32), mother Mary (65) and his two-year-old son Aaron drowned.\n", " \n", "According to police, the accident occurred when the family was returning after a family function of a relative’s house. Police said that Belby that the curve is too deadly that the driver may drove into the canal accidentally. The car tumbled into the waters at Kanakkakadavu and Belby down the windows to get out of the car. Police said that he managed to pull out Honey grabbing her by the hair but he couldn’t carry her to the shore. \n", " \n", "The area is a very deserted with a very few house around and no one saw the accident happening. After a while, a passerby noticed Melby crying out for help but by the time he had lost hold on. He called for help and fished out Mary and Honey. They were taken to a hospital where he was declared brought dead. The toddler whom Honey was holding onto got slipped off from her hand and got washed off in the melee.\n", " \n", "The fire force unit was alerted but the team which arrived had no scuba divers with them. The local residents had picked up a clash with the officials as they arrived without even enough provisions for lighting. The search for the toddler was held under the light of two torch lights brought by Puthanvelikara police till more lighting equipment were brought in later. A JCB later fished out the car, however the body of the toddler was not in it. Local residents recovered the body at around 2.30 am from about 50 metres away from the spot of the accident. \n", " \n", "The body was handed over to the kin by Sunday evening after post-mortem. Melby is working as an engineer and is yet to recover from the shock. Police have registered an FIR and has launched a probe into the accident.\n", "\n"], "title": "Car falls into canal, toddler, two women die"}
]