[
{"top-line": "\r\n   The forest department on Thursday arrested three bikers who had chased the lions in Babra area of Junagadh recently. The three were arrested based on the registration number of the bike, which is of Rajkot.",

 "source": "\r\n    TIMES NEWS NETWORK \n\r\n  ",
  
  "lines": [" The three arrested are in the age group of 18 to 22 years.Those arrested include Ajay Vala (18), a resident of Babara, Ankur Padashala (22), a resident of Rajkot, and Jayesh Patat (20) and a resident of Babra. All the three are residents of Rajkot.", " After a video went viral \non social media showing four bikers \nchasing the lions, lionesses and their cubs and the animals fleeing from fear, the state fo\nrest department launched an inquiry to identify the culprits. The vi\ndeo, which lasts less than a minute, showed one bike with registration number of Rajkot.", " The video had caused outrage among wildlife lovers and activists. Sources said the video seems to have been \ncaptured in Amreli area, where there is little surveil\nlance by foresters and lions roam outside \nprotected area.", " The video \nshows the group of lions running frantically to put space between them and the ve hicles in an \nopen field. One t of the bikers in t \nblue shorts is seen turning back and chasing two lionesses and cubs who had fallen behind. Although none of the bikers could be seen properly in the video, one of them is heard asking the other in Gujarati to chase the lion cub. \nHowever, in the end another biker in yellow shorts is heard trying to stop others from doing so.", " A wildlife enthusiast Raviraj Kathi, who made the video viral on social media, said the video is from Babra area that is notorious for holding illegal shows by giving bait to the big cats.", " The forest department got the address from the regional transport office following which the three were arrested from Rajkot. The fourth person has been identified and he is a resident of Babra.", " Chief conservator of forest A P Singh said the fourth person sitting on the other bike was shooting the video. \n\r\n                                        "], 
  
  "location": "\r\n  Ahmedabad: \n\r\n  ",
  
  "title": "\r\n   Three bikers who chased lions nabbed   \r\n "}
]