["An 18-year-old man was crushed in an accident near the Khandala tunnel on the Pune-Mumbai Expressway on Sunday evening.", "On April 19, three people including a nine-year-old girl died after their car hit a tree on the expressway.", "Six others suffered injuries and were admitted to a local hospital.", "On April 16, the cleaner of a tempo was killed instantly while its driver sustained serious injuries when the vehicle rammed into a stationary truck on the expressway.", "A 25-year-old youth died after he was hit by a speeding four-wheeler at Indraprasth square in the city early morning on Sunday.", "The incident took place early morning at around 5:00 am at Indraprasth square when the youth identified as Palash Singhai was on his way back home after dropping his cousin Navdeep Jain at Bhawarkuan.", "A 50-year-old man was killed in an accident after being mowed down by a truck on Friday on Khandsa Road.", "The incident happened around 8.20am on Friday.", "Celebrations turned into mourning in Dudera village on Saturday night as two persons attending a wedding procession died while three others received serious burn injuries when a van carrying the members of a music band hit a low-hanging 11 kV wire.", "A 54-year-old woman died of heart attack and four others were injured after a cab rammed through a parapet wall and plunged into a subway 20 feet below near the Reserve Bank of India building on Rajaji Salai on Sunday evening.", "A birthday celebration ended abruptly with the birthday boy and 10 of his friends landing in hospital early on Sunday.", "The 11 friends from Bhandup, all of them crammed into an SUV , had cut a cake in Bhandup to usher in the friend's 26th birthday, and were headed towards Marine Drive for a little do in town when they met with an accident on Matunga flyover.", "A driver for former Tamil Nadu chief secretary P S Rama Mohana Rao was fatally knocked down by a private bus near Tambaram on Saturday night.", "Police said Ravichandran, who later became driver for R Jaya, a special secretary in the municipal administration and water supply department, was riding his motorbike when the incident occurred on Mudichur Road.", "One person died and four were critically injured when a corporate school bus skidded and ploughed into the footpath at Novotel Junction on Beach Road in Visakhapatnam on Sunday night.", "A pillion rider was killed and three others were injured in two separate road accident cases that occurred between Sunday night and Monday morning.", "The first accident took place on Vashi bridge on Sunday night around 9.30pm where a pillion rider fell off after his bike skid and was run over by a car from behind.", "In the second accident, which took place on the Airoli bridge on early Monday morning around 3:00am, a car rammed into a luxury bus while overtaking.", "At least 30 people suffered injuries when a private bus skidded before turning on its side and falling into a rivulet near Kakrapar Patiya under the limits of Mandvi police station in Surat district around 10.15 am on Monday.", "One person was killed and nine others sustained injuries when two cars in which they were travelling in collided head on near Maravanthe on the National Highway 66 on Monday.", "Enraged by the death of an 18-year-old school student while alighting a Haryana Roadways bus near Achina Tal village of Charkhi Dadri on Monday, a mob went on rampage and torched the vehicle.", "Thirty-two-year-old Mutheeswaran, the cabbie who fell into the RBI Subway, on Sunday is yet to recover from the shock.", "He along with a family of four from Colombo rammed into a parapet wall and landed in the subway on Sunday evening.", "A 36-year-old farmer died and another person suffered critical injuries when they were hit by a speeding Toyota Fortuner vehicle at Maheswaram on Monday afternoon.", "At 3.30 pm on Monday, a speeding Toyota Fortuner vehicle (AP 16 CC 3323), driven by S Ratna Kumar, 26, of Guntur, rammed into a bike and a pedestrian standing next to the road near Rachulur X Roads on the Sri Sailam-Hyderabad road.", "Six people returning from a marriage party in Nerwa area of Shimla district were killed when the car they were travelling in, fell into a gorge in Nerwa area on Tuesday wee hours.", "Five employees of a Gurgaon-based IT firm — Ameriprise India Private Limited — were injured when the car they were travelling in met with an accident on Gurgaon-Faridabad road late on Monday.", "A 27-year-old man was killed near Shankar Chowk flyover on Monday around 8:30pm when an unidentified vehicle hit him while he was crossing the road.", "One person was killed and 15 injured when a truck collided with an Uttarakhand Roadways bus at Hapur Chungi intersection in Kavi Nagar around 2.30am on Tuesday when passengers were asleep.", "Two elderly persons were injured when a speeding school bus rammed against a car near Dalit Prerna Sthal on the Noida-Greater Noida expressway on Tuesday morning.", "Two elderly persons were injured when a speeding school bus rammed against a car near Dalit Prerna Sthal on the Noida-Greater Noida expressway on Tuesday morning.", "Three pilgrims including a woman died and six others were seriously injured when a container truck crashed into a group of devotees going on foot near Prantij town of Sabarkantha district on Tuesday.", "A six-month-old girl was orphaned after her entire family - parents and elder brother - died in an accident on Sunday evening.", "The incident took place at 6pm when Ram Sajeevan slowed his bicycle at a traffic signal.", "As soon as he stopped, a silver Santro car rammed the bicycle, flinging the family onto the other side of the median.The incident took place in outer Delhi's Narela when the family was going to buy medicines for the baby as she was suffering from viral fever.", "After battling for life for four days, 12-year-old Vatsal Yadav, who was injured in an accident while returning home from school on Saturday, succumbed to his injuries on Tuesday night at Artemis Hospital.", "Vatsal, a Class VII student of St Michael's Senior Secondary School in Shivpuri, was severely injured on Saturday when he, along with his cousins, was returning home to Dhanwas village in a school cab hired by Vatsal's parents.", "The cab, a Maruti van, collided head-on with a two-wheeler near Dhankot village.", "Wedding celebrations turned into a mourning for relatives of six who died in a road accident on Tuesday morning.", "The victims were returning from a marriage party when the car they were travelling in plunged into a 300m deep gorge in Nerwa area of Shimla district.", "Seven persons were killed when the car in which they were travelling hit a truck from behind near Sagara road of Ayanooru on Wednesday night.", "Three youths were killed and another was seriously injured when the car they were travelling in collided with a bus in Manan Dham area under Muradnagar police station on Thursday afternoon.", "The driver of a tractor carrying water was killed after being hit by a speeding truck on NH 4 near Chitradurga on Thursday.", "A woman died after she was hit by a water tanker while walking at Madhapur on Thursday.", "At least 14 feared dead while 29 sustained injuries when a truck ferrying over 50 people drove into a roadside canal in Uttar Pradesh’s Etah district.", "The accident took place near Sarai Neem on Tundla road in Jalesar area around 2:30 am when the truck, carrying a wedding party, was returning from Sakrauli in Jalesar area of Etah district.", "A 22 year-old TV actress was killed and two injured in a car accident after the vehicle hit the centre median on the Chennai-Bengaluru National Highway 48 near Natrampallai during the early hours of Friday.", "A speeding private luxury bus rammed a motorcyclist at Mahila College underbridge on Kalawad Road late night on Wednesday, killing him on the spot.", "A woman lost her life after being crushed between Hampi Express and the platform at Bhanapur station on Wednesday night.", "Three people were killed and several others injured in two different road accidents in Kherki Daula and near Iffco Chowk on Wednesday and Thursday, respectively.", "In the first accident, a Tata Magic Van carrying 12 passengers rammed into a Renault Duster near Iffco Chowk on Thursday around 1.20pm after it took a turn near Leisure Valley.", "In another accident occurred in Kherki Daula on Wednesday evening when a Chevrolet Beat crashed into an auto near Rim Jhim Hotel, said police.", "Vishakha Maind, former BJP corporator between 2007 and 2012, was killed in a road accident near Saunsar in Madhya Pradesh.", "Six other members of the family, including Vishakha’s 70-year-old mother Sunanda Shende, were injured in the accident that took place at 5.40am.", "A head constable died after a speeding truck hit his bike in Sihor town of Bhavnagar district on Friday.", "A Congress councillor from Jetpur municipality died after his SUV veered off the road and fell from a bridge near Pithadiya toll booth on Rajkot-Porbandar highway on Thursday.", "Six people, including a 14-year-old boy, were killed and 15 injured after a government bus they were travelling in rammed a lorry near Dindigul on Friday morning.", "The accident took place around 9am at Ammai Nagar near Chinnalapatti.", "A 24-year-old customer care executive, who was riding on a motorcycle, was seriously injured after he was hit by a speeding car near Vishal Mega Mart on Shivarkar Road, Fatimanagar, around 2.45am on Thursday.", "A youth from Cunchelim in Mapusa died in a road accident on Friday.According to Mapusa police, the accident took place at about 8.15am.", "A deep crater developed after road caved in at the junction of Poonamallee high road-Taylors road at around 5.30am on Saturday.", "No one was injured in the accident.", "Two labourers were run over by a truck when they were sleeping in the cricket ground of Vesu on Saturday.", "The driver of a car at speed lost control after a suspected flat tyre and the vehicle jumped the divider and smashed into oncoming traffic on Saturday morning.", "Five or six two-wheelers in the opposite lane were hit and a total of seven persons were hospitalized by EMRI 108 teams.", "A 10-year-old girl was mowed to death by a pick-up van near Shivdaspura on Saturday evening.", "Three people died and four were injured when a speeding tanker rammed a stationary truck at Irrigation Colony Chowk in UruliKanchan on the Pune-Solapur highway around 4am on Saturday.", "One person was killed while his four friends had a miraculous survival as a speeding SUV fell into Hindon canal after breaking a steel barricade in Ghaziabad on Saturday.", "The accident took place a little after 8pm on a narrow road running along the Hindon canal between the old Kanawani bridge and a Shiv temple.", "An egg-laden truck collided with a crane near Kamseth tunnel about 70 kms from Panvel on the Mumbal lane of the Pune Expressway on Sunday around 8.45 am causing severe traffic snarl as the impact of the collision resulted in spilling of several egg trays on the highway and made the road slippery.", "Days after Char Dham yatra began in Uttarakhand, four pilgrims were killed and six others injured — all hailing from Amravati in Maharashtra — after the vehicle they were travelling in from Gangotri to Kedarnath fell into a 300-metre-deep gorge in Ghansali tehsil of Tehri Garhwal district Saturday afternoon.", "A businessman was killed and another suffered severe injuries after the car in which they were travelling plunged into a gorge by the roadside near Boliyar Padil under Konaje police station limits, on Friday.", "Six children were killed and 25 others were injured when a tractor trolley, in which they were travelling, overturned in Sawai Madhopur district on late Saturday night.", "Two people were killed and 10 others sustained injuries after a speeding tempo hit a truck on NH-150A between Baklurahalli Gate and BG Kere in Challakere, Chitradurga district, early on Sunday.", "A minor, identified as Ashma Afrin, died and at least 15 others received injuries in a series of accidents in several parts of the state on Sunday.", "Three persons of a family were killed in road accident near Dhrol town of Jamnagar on Monday early morning.", "The fatal accident took place on NH-31 at Haripur of Nalbari when a passenger-carrying tempo Afrin was travelling in was hit by a speeding car.", "In a separate accident in South Salmara district of lower Assam, four persons sustained injuries in New Fekamari Chariali of Mankachar.", "A neighbourhood tiff over scratches on a brand new SUV spiraled into a macabre murder in the wee hours of Sunday in which a young man was allegedly beaten up, dragged behind an SUV , smashed against a tanker and then deliberately run over.", "Five people from Virar in Mumbai were killed and five others were injured when their car skidded on diesel spilt by a luxury bus and crashed into the stationary bus in the Kamshet tunnel on the Pune-Mumbai expressway around 3.30pm on Sunday.", "A 55-year-old man died and five others were injured in a road accident at Gokul Shirgaon area on Pune-Bangalore national highway on Monday morning.", "A woman riding pillion on a bike with her husband on the Mumbai-Goa highway died due to severe head injuries as she fell off the bike after her saree got entangled in the moving bike’s rear wheel’s chain.", "The incident occurred on Saturday around 6 pm near Kharpale village.", "Less than a month after a speeding car mowed down a three-year-old girl and her mother on Baner Road, another accident occurred on Monday morning close to the same spot when a sedan rammed into a Hyundai Xcent, injuring the driver and another person.The incident occurred around 9am when the Hyundai Xcent which was driving towards the city was hit by a grey sedan headed in the opposite direction near the National Insurance Academy.", "The driver who was behind wheels when singer Kalika Prasad Bhattacharya was on his way to a performance in Birbhum on March 7, a journey that ended tragically with an accident at Hooghly’s Gurap that killed the folk musician, was denied bail on Monday.", "Three persons were killed and one injured when a speeding car rammed into a trailer truck near Gadadar village, some 10km from Shyamlaji in Sabarkantha late on Sunday night.", "Three persons were killed and 30 injured after a tempo overturned subsequent to hitting a motorcycle near Kocharba village near Vapi in Valsad district on Monday afternoon.", "Om Prakash Dhawan, a senior citizen who was hit-and-run over by an unidentified vehicle on April 24, succumbed to injuries on April 26, said Ellisbridge police officials.", "A 12-year-old girl died and two others suffered severe injuries when a speeding car dragged the motorcycle they were riding on to over one and half kilometre near Uchhal taluka of Tapi district on Monday.", "A driver and his cleaner died after their truck overturned and got engulfed in fire near Malvan Chowkdi on Viramgam-Kutch highway late night on Sunday.", "In the wee hours of April 29, an earth-shattering crash woke up residents of Lake Market area.", "A white sedan had crashed into a lamppost and turned on its side.", "The fatal accident killed model and TV host Sonika Chauhan and left her friend, Vikram Chatterjee, who was in the driver’s seat, severely injured.", "Fatigue took its toll on a car driver on Sunday morning when he dozed off, lost control over the wheel and the car crashed against the roadside cement railing killing a 55-year-old woman on the spot at Swami Chincholi village near Daund, 85 km away of Ram Mandir Road in Mumbai.", "Two persons, including a deranged woman, were killed in separate hit-and-run cases in the last 24 hours at different places.", "Two persons died in separate hit-and-run incidents in Bilaspur and Civil Lines early on Monday.", "In the first incident, the deceased, identified as Akash (28), who was returning from a night shift at a private company was hit by a canter near Mokalwas village.", "The second incident happened in Sector 15 part 2 area.", "A 33-year-old tempo driver, Raju Prasad Yadav, was killed when an unidentified vehicle rammed into his Tata 407.", "Four people, including two women and a minor girl of the same family, were killed and eight others injured in a head-on collision between a Skoda Rapid and a Swift Dzire near Mubarikpur on Farrukhnagar-Jhajjar road on Monday night.", "Andhra Pradesh Minister P Narayana's son and his friend were killed when their car rammed into a pillar in the Jubilee Hills area here early on Wednesday.The accident occurred at around 3 am when the SUV, being driven by state municipal administration minister's son hit the pillar.", "Three people were killed in a road accident near Masinagudi in the Nilgiris on Monday night.", "Shanavaz Munaf Chauhan (18), resident of Savarkundla town of Amreli, died and his friend Ajay, was injured when their bike collided with a truck near Lapaliya village on Savarkundla-Amreli road on Wednesday.", "Andhra Pradesh minister P Narayana's son Nishith Narayana died after his Mercedes Benz SUV rammed into a metro pier in Jubilee Hills area early Wednesday morning.", "Nishith was returning home with a friend K Raja Ravi Chandra (24) in his Mercedes Benz G-63 AMG when he lost control at a curve and rammed his SUV in a metro pillar on Road No.", "36 near Heritage outlet at around 2.45 am.", "Eleven labourers were killed and 15 injured after a mini-truck they were travelling in fell off a bridge in Jabalpur district late on Wednesday night.", "The incident took place near Hotia junction at around 1am.", "Three persons died, two of them on the spot, when a goods tempo collided with the motorcycle in which they were travelling, at Kalladaka junction in Golthamajalu village in the early hours of Thursday.", "After a hard day’s work, rickshaw puller Kalua Singh was sleeping outside a photocopy shop on Tara Road when the sound of squealing tyres woke him up.", "This was followed by an ear-splitting crash.", "Staying a few metres away from the accident site, he was the first one to reach the spot in the wee hours of April 29.", "It’s the accident that killed model-anchor Sonika Chauhan and had Vikram Chatterjee at the wheel that fateful night.", "“It was 3.25 am when I was woken up by the noise that could be heard even from Gariahat; it was that loud.", "A 10-year-old boy was crushed to death by a bus in south west Delhi’s Mahavir Enclave on Thursday.", "In the first incident, a 25-year-old biker, Avghesh Mali, died early this week after battling for life post being hit by a tempo on April 20.", "In the second incident that took place on Wednesday, two men suffered injuries after a speeding car hit their bike.", "An irate mob set three dumpers afire and pelted stones at vehicles after a 13-year-old boy was crushed to death by a speeding dumper near Mandar crossing under Puramufti police station in Kaushambi on Thursday.", "A day after AP minister P Narayana's son was killed in a road accident aused by over speeding at Jubilee Hills Road No.", "36, the Hyderabad police decided to eclare the area of the mishap s being accident prone.", "An adult female deer died after being run over by an autorickshaw at Goregaon on Western Express Highway around 12.30 am on Friday.", "A 16-year-old died in a road accident on the SP Ring Road on Thursday night.", "A software engineer, Jeetesh Jadhav (35), died after he lost control of his car and rammed it into a moving truck in Kamshet tunnel on the Pune Expressway on Friday.", "Four helmetless youths -all on one bike -were hit by a truck when they were speeding down Taratala Road.Two died on spot and the others were severely injured.Around 2.30am on Friday, Aqibuddin (20), Mehluz Alam (21), Shaisha Hussain (24) and Sabir Ali (23) were on their way to a graveyard in Park Circus from their Garden Reach homes to offer prayers on the occasion of Shab-e-Baraat, the 24-hourlong festival when Muslims pray for forgiveness for the past and seek blessing for future.", "Five persons, including four members of a mason's family , were killed in a road accident on the Hyderabad-Bangalore highway on Thursday night.", "Nerul resident Jeetesh Jadhav, a 35-year-old software engineer, was killed and three others, including his wife, were severely injured when their car crashed into a moving truck inside Kamshet tunnel on the Pune-Mumbai expressway around 8.30am on Friday.", "Two persons were killed and three others were critically injured when a speeding Maruti Swift Dzire rammed into a truck on Yamuna expressway on Friday morning.", "Barely three days after Andhra Pradesh Minister P Narayana's son lost his life in a SUV crash at Jubilee Hills, three IITians employed in top software firms in the city died and their friend suffered injuries in a road mishap at Tukkuguda on the Outer Ring Road when they were en route to attend a colleague's wedding at Khammam on Friday morning.", "In a tragic accident seven persons including two women and a girl child were killed and four others grievously injured after a car in which the victims were travelling rammed against a lorry Kulithalai in Karur district during the morning hours on Saturday.", "Four people died on the spot while five others seriously injured when the autorickshaw they were travelling in was hit by a bus near Vani Phata, around 8km from Hinganghat, on National Highway-7 on Saturday evening.", "With two major road accidents in the city still fresh in memory, another road accident took place at busy Madhapur on Saturday night in which a biker died and four others suffered injuries.", "Hitesh Parmar (30), a resident of Ambedkarnagar in Wankaner town of Morbi, died after two bike drivers collided on outskirts of Wankaner town on Friday night.The incident occurred near Samrat Hotel.", "Another biker, identified as Deepak Sindhav, was also injured and was rushed to hospital.", "A trip to buy clothes for a wedding turned into a tragedy when two siblings were killed and three people injured in a road accident on Mysuru Road on Saturday evening.", "Police said one of the car's tyres burst and the driver lost control of the vehicle.", "In another accident, a man on his morning walk was hit by car and killed in Kengeri's Hoyasala Circle on Saturday.", "A 15-year-old boy was killed and his friend critically injured after coming under the wheels of a cement mixer truck while they were cycling near Model Town on Sunday evening.", "Five people belonging to a family from the Diamond City were killed and three injured when the car in which they were travelling crashed into a road divider on National Highway no 53 near a bridge at Killa Pardi of Valsad district on Sunday.", "The urban development minister has ordered an inquiry into the death of three people, who were allegedly killed in an accident in Jaspur on Saturday, after their kin suspected it to be culpable homicide.", "Two persons, including an eight-year-old boy, died and three others were hurt when a biker in a bid to overtake an RTC bus crashed his Yamaha FZ into an oncoming Skoda Octavia at Kadthal on Sunday morning.", "Five members of a family from Ludhiana were killed in a head-on collision between a car and a truck near Khurampur village near here on Phagwara-Hoshiarpur road on Sunday.", "Three tourists from Tamil Nadu were killed and 14 others injured when the vehicle in which they were travelling rolled down a gorge in Chhadol in Bilaspur district of Himachal Pradesh on Sunday.", "An Indian student, pursuing masters in electrical engineering at Northern Illinois University, was killed in a road mishap in Illinois, US.", "Five persons were killed and 50 others injured when a bus, carrying mostly brick kiln labourers, overturned and tumbled into a ditch in Nawada district in the early hours on Monday.The condition of 12 passengers was serious.", "Of the five persons who were killed, two were minors, the police said.", "Three students of a private university died and four of their mates were battling for life when the Honda City car they were travelling in to appear for their first-year exam crashed through the railings of a railway bridge near Shakurbasti in west Delhi, and fell nearly 40 feet to the ground on Monday morning.", "A 20-year-old girl, who was searching for a restaurant to get a bottle of water, was crushed to death under the front wheels of a heavy truck on Monday around 10am.The tragic accident happened near Kapsi Bridge in Kalamna.", "Three persons of a family were killed in road accident near Dhrol town of Jamnagar on Monday early morning.", "A 25-year-old man men, who was riding pillion on a bike which his friend was riding, died in an accident on the Ghatkopar flyover early on Monday.", "The rider of the two-wheeler sustained serious injuries.", "A truck driver went on a rampage injuring two people and damaging as many as six vehicles on Sunday night.", "He, however, ran out of luck after his vehicle hit the entrance arch of Bhawani Mandap near Mahalaxmi temple.", "A 38-year-old professional biker from Kothrud fell to his death from the Paud Phata flyover in the early hours of Monday after his new high performance motorcycle crashed into the guard wall.", "Five persons were killed and 10 others injured, three of them seriously, when their SUV rammed into a stationary truck near Mahisona village in Lakhisarai district on Tuesday.", "A day after a Honda City crashed through the railings of a railway bridge near Shakurbasti in west Delhi, another girl injured in the accident succumbed to her injuries on Tuesday morning.", "The condition of the other three injured is still critical and they have been shifted to the ICU.", "Two people were killed in Sector 53 and Udyog Vihar in two separate cases of hit-and-run on Monday.According to police, the first incident happened near Ram Chowk in Dundahera at 5 am on Monday.", "A biker died after being hit by a speeding Skoda car on NH-58 in Muradnagar on Monday night.", "A 20-year-old woman was run over by a bus driven by a temporary driver in Tirupur on Tuesday, shocking the public.", "Two women were killed on the spot and several passengers injured after a private bus toppled on the busy Charmadi Ghat, near here on Tuesday.", "Three persons from Surat in Gujarat were killed after their multi-utility vehicle hit a truck on the Pune-Solapur highway in the early hours of Tuesday.", "A Goa Police van rammed into a house and four parked two-wheelers in the wee hours of Wednesday near Azad Maidan in the capital city, after being hit by an unidentified speeding car from behind, police said.", "Police said nobody was injured.", "A woman undertrial and a police constable died after a police jeep overturned near Jawangadh, about 22 km from Himmatnagar town, on Thursday.", "Four members of a family from Songadh-Vyara had a narrow escape when their car plunged 20 feet deep into Icchapore creek near here on Wednesday evening.", "Three persons were killed when a speeding jeep rammed into another one coming from the opposite direction near Gama Vas, some 20km from Palanpur town on Tuesday night.", "One person died on the spot late on Tuesday while two others succumbed to injuries in the wee hours of Wednesday, said police.", "Two people died and five were injured after the brakes of a concrete mixer truck failed and the vehicle rammed into an autorickshaw in Ambernath on Wednesday afternoon.", "Five persons, including three children were killed, after a speeding truck rammed into a hut located along National Highway 33 under Dhalbhumgarh police station area in Ghatshila sub division on Wednesday.", "One person died and 12 others injured when a car plowed into pedestrians in New York's busy Times Square today, with authorities saying the driver of the vehicle, a US Navy veteran, has a criminal history and record of drunk driving.", "A 13-year-old girl died and 37 others were injured when the truck they were travelling in overturned in Sutrapada town on Thursday.", "Six members of a family, including three women, were killed and one another person was injured after their car collided with a luxury bus in Ranavav taluka of Porbandar on Thursday afternoon.The accident occurred at a sharp curve near Janawala ness.", "A school bus and a school van collided in Sector Gamma I on Thursday afternoon.", "Students in both vehicles escaped with minor injuries as the two vehicles were moving slowly.", "Two persons died and one suffered injuries in two separate road accidents in the city on Friday.", "In the first accident that occurred at 5am on Manchal-Ibrahimpatnam road, a woman died on the spot while her husband was battling for life at a hospital after their bike rammed into a tractor parked carelessly on the roadside.", "In another case, a street vendor, M Krishna, 19, of Sanjeev Nagar in Maheshwaram died on the spot when he was hit by a truck (HR 47 C 4281) near toll gate 16 on the ORR at Tondupally in Shamshabad.", "In a freak accident, a 20-year-old motorcycle rider came under the wheels of a bus and died on the spot allegedly after being hit by the gate of a car, which was “opened abruptly” by its driver.", "A 23-year old woman was killed after a speeding car hit her scooter in Surajpur area in Greater Noida on Friday morning.", "Five persons were killed when a car collided with a truck in Raichur district on late Friday night.", "Three senior citizens on a morning stroll were run over by a speeding SUV in Betul district on Saturday.", "One dead and 14 were injured after the private bus they travelled reportedly hit the divider and turned turtle at Gandhi Nagar junction in Vikhroli (West) on Saturday.", "Five people, including a three-year-old child, were killed in a road accident involving two sports utility vehicles (SUVs) near Karaikudi in Sivaganga district on Sunday.", "One died and 17 people were injured when a private luxury bus hit the divider and turned turtle at a sharp turn near IIT-Powai, at Gandhi Nagar junction in Vikhroli (West), on Saturday.", "Two persons were killed while two others were seriously injured after the mini-truck they were travelling in collided with a tree near Rashtriya Dalit Prerna Sthal in Noida on Saturday morning.", "A two-year-old girl, who was playing outside her house, was run over by a Toyota Qualis car, which was reversing, at Shatamrai on Saturday.", "Two people were killed and two others were injured after an SUV crashed into the median on the Grand Southern Trunk Road in Vandalur on Friday night.", "A 59-year-old woman was killed and six others injured in an accident, when an SUV they were in was hit by a truck coming from the opposite direction at Gaibi chowk in Radhanagari on Saturday.", "It was a free for all as a bike carrying polythene pouches of country liquor had an accident near Rajka crossroads on Khodiyarnagar- Mehamdabad road on Saturday night.", "Four members of a family from Rajkot were killed and one was injured when a tree fell on their car in Dang district on Sunday evening.", "A 50-year-old man was killed in a hit and run accident, near a petrol pump on Wazirpur road around 10pm on Saturday, by an unidentified vehicle.", "Three persons were killed and 18 sustained injuries when a Pepsu road transport corporation (PRTC) bus heading to Ludhiana from Bathinda collided head on with a canter on Bathinda-Barnala highway near village Jethuke on Sunday morning.", "Seven persons, including four women and three men were killed in a road accident near Umranangal Chowk in Beas, 35 km from Amritsar on Sunday.", "The accident took place when an over speeding SUV crashed into two vehicles.", "A luxury bus with 50 passengers toppled near the Dadar TT flyover on Sunday morning after hitting a divider, killing one person.", "One person was killed and nine were injured in three different accidents in the city on Sunday.", "Around 1pm, two men on a bike, both without helmets, were hit by a state bus of route E-32 on Talla bridge when they came on the main road from an alley.", "In the wee hours of Sunday, a sedan, driven by a middle-aged man with his wife sitting beside him, was hit by an SUV at the AJC Bose Road-Shakespeare Sarani crossing.", "In another incident, a truck loaded with vegetables crashed against a mini truck also carrying vegetables at the crossing of Bidhan Sarani and Vivekananda Road around 3.30am.", "At least six people were killed and 28 injured, when a bus fell into a gorge in Dindori early Sunday morning.", "Most of the 40 passengers, who were travelling by the ill-fated bus, were from Jabalpur and the tragedy took place near Jogitikaria village.", "Two men were killed and five others were injured when their SUV rammed a jugaad (a three-wheeled cart powered by a scooter engine) and then overturned after hitting a divider on the Najafgarh-Bahadurgarh road in southwest Delhi on Saturday night.", "Five people were killed in different accidents in and around the city between Friday and Sunday.", "The accidents occurred in Chinchwad, Nigdi, Bhosari and Hadapsar.", "In a hit-and-run crash in Muradnagar, a man died on the spot while his wife was critically injured when a vehicle rammed into their scooter on Sunday.", "Around 5pm on Sunday, Ompal (44), the deceased, was returning to his home in Khichripur with his wife when the couple met with accident on NH-58.", "Two people were killed early on Monday when their bike crashed into a divider near Shankar Chowk Road.According to the police, the accident happened near the T-point of Shankar Chowk Road at around 3am.", "A recklessly-driven Bolero vehicle hit a road divider few metres away from Arang toll booth leaving two dead and three injured on Monday.", "A computer professional’s wife and his 81-year-old father died after their car rammed a stationary truck at Singur on Durgapur Expressway around 1.30am on Tuesday.", "The spot is 1km away from where Trinamool Congress MP Abhisek Banerjee was critically injured when a speeding truck collided head-on with his vehicle on October 18 last year.", "Shubham, a second year BSc student, was a resident of Nikol.", "He met with an accident on May 19 on Bavla – Bagodara road in Ahmedabad district, when he was on his way to Bhavnagar for the event management firm he worked for.", "An 18-year-old junior college student secretly took his friend's car for a spin on Monday evening only to mow down a teenaged scooter rider at Famous Chowk in Sangvi.", "Six members of two families from East Delhi were left critically injured when a Scorpio they were travelling in plunged into a 200 feet deep gorge near Spring Road in Library area on Tuesday.", "At least 21 Char Dham pilgrims are feared dead while seven others have been injured after a bus carrying devotees from Indore in Madhya Pradesh plunged into a gorge near Dharasu in Uttarkashi on Tuesday.", "A 12-year-old boy was killed and 7 others were injured when the car in which he was travelling overturned near Murlipura locality in the city in the morning.", "In another accident a rashly driven truck hit a scootey near Rambagh circle in which one person was killed and another was injured.", "Two people were killed and 24 others were injured when a van carrying wedding guests overturned near Saratchandrapur in Mayurbhanj district on Tuesday.", "The incident happened at around 1 am while they were returning after attending a wedding ceremony at Saratchandrapur.", "The wedding party started the journey home after dinner.", "Two kilometres into the ride, the van overturned.", "Two people died and three were critically injured after getting mowed down by a speeding low-floor DTC bus near Azadpur Metro station on Wednesday afternoon.", "A trip to Kodagu ended on a tragic note for two Bengaluru students, who died after the bike they were on collided with a car near Bylakuppe, 80km from Mysuru on Tuesday.", "Three of a family died and two others suffered injuries when a speeding truck rammed a sport utility vehicle (SUV) they were travelling in on the Annur Road in Mettupalayam on Wednesday.", "Seven pilgrims from the district were killed when a speeding truck knocked down the sports utility vehicle (SUV) in which they were travelling.", "The accident occurred close to Dhangarwadi on Ahmednagar-Aurangabad highway at 2am on Wednesday.", "A freak accident at railway crossing gate 92 near Partur, a few minutes before passing of Manmad-Dharmabad-Marathwada Express on late Tuesday evening, sparked rumours.", "Two auto drivers suffered minor injuries when an auto trolley was hit by a cab from the rear at APPA junction near Narsingi on Wednesday.", "A day after a bus carrying 30 Char Dham pilgrims from Indore fell into the Bhagirathi river in Uttarkashi district, rescue teams have recovered 24 bodies on Wednesday.", "The 40-year-old victim had submitted the application seeking compensation on March 7, 2012.", "He said that on February 10, 2012 around 4.30 pm he was riding his motorcycle on the Sion Trombay road when a tempo came from the opposite direction and dashed against him.", "He said that he sustained severe injuries and was admitted to Shatabdi Hospital.", "He was then shifted to Sion hospital where he was admitted until February 22, 2012 .", "A post-midnight accident left six buffaloes dead and 18 injured on Outer Ring Road in south Delhi, bringing the morning traffic on Thursday almost to a standstill.", "A truck bearing a Rajasthan registration plate and loaded with the animals overturned on a diversion loop heading towards the Hauz Khas flyover at around 1am.", "An accident on Thursday on the Vallarpadam container road claimed one more life when a car rammed a parked container.", "Three persons died and five others were injured when a luxury bus collided with another bus near Jambua Bridge on National Highway 8 on Thursday morning.", "The accident happened when one of the buses was parked by the roadside near the bridge at about 4.30 am.", "A luxury bus going towards Goa met with a fatal accident on the Mumbai-Goa highway in Ratnagiri district on early Friday morning, killing at least two persons and injuring 21 others.", "Six persons of a marriage party, including the bride, died when their minibus collided with a private bus in Uttara Kannada district on Thursday morning.", "Drivers of both buses died in the accident, which occurred at Anantawadi village in Honnavar taluk on National Highway 66.", "In a second road accident, a naval officer, identified as Naresh Kumar, 32, died on the spot when his bike crashed into a private bus in front of INS Kadamba naval base.", "Eleven persons including six women and four children were killed when a tractor trolley they were travelling overturned in Neemuch district on Thursday.The accident took place today afternoon when the victims were returning to their native village Khandariya Kacharia in Mandsaur district after offering prayers at Sanwaria Seth temple in Rajasthan, Neemuch police said.", "Medical tests conducted on Maharashtra State Road Transport Corporation (MSRTC) bus driver Ramesh Sahdev Kamble, who lost control of the vehicle in Kolhapur on Wednesday evening, have revealed that he has brain tumour.", "Two people were killed and 10 others were injured when Kamble rammed into several vehicles on a busy chowk on Wednesday evening.", "A traffic cop sustained serious injured after a car hit him while he was on duty at Iffco chowk on Thursday.", "Eight persons were today killed after their car rammed into a tree and overturned in the district, police said.The mishap occurred at around 7 pm at Rahuri, 50 kms from here, said District Superintendent of Police Ranjankumar Sharma.", "Three people, including a 10-year-old boy, were killed and 28 others injured after a luxury bus in which they were travelling overturned on Friday as the driver was trying to negotiate a curve near Chiplun on the Mumbai-Goa highway.", "Around 4am, the bus going from Parel to Malvan in Konkan, overturned while taking a turn close to Chiplun.", "Five persons, including two women, have been killed and 28 injured when their van turned upside down near Kothagiri in Nilgiris district, police said on Saturday.", "Two persons were killed and 26 others sustained injuries when a bus overturned in Gandhwani area of Dhar district on Saturday.The incident took place when around 30 people of a marriage party were on their way to Indore in the bus from Jamli village in Dhar district.", "A trolley loaded with iron rods rammed onto a divider near Teen Hath Naka flyover in the wee hours of Saturday morning.", "A major accident was averted as the accident took place at around 4 am, when there was hardly any traffic movement on this otherwise busy stretch.", "A leisure trip ended in tragedy for a group of tourists from Vellore when the van they were travelling in rammed a parapet wall on roadside near Thattapallam on the Kotagiri-Mettupalayam road Friday late night, while they were returning home after visiting Ooty, killing five and injuring others.", "A 14-year-old boy was injured after the school bus ran over him on Friday.", "Vishnu Mishra, a student of Class IX in DPS, Jankipuram, was injured after he slipped and fell in a puddle and the school bus ran over him.", "Piolinho Barreto, 60, a barge owner from Chicalim, was hit by a tempo at Vaddem, Vasco, on Saturday evening.", "Two persons died when their motorcycle was hit by a truck near Viramgam on Saturday.", "A Talegaon Dabhade police constable suffered injuries after a history-sheeter, Subhan, who was involved in the early morning robbery and car jacking case on Pune-Mumbai expressway on May 25, knocked him down with the stolen car on the same night on Dehu Road.The police said two constables noticed the stolen car and tried to stop it near Thomas Colony on Dehu Road around 11.30pm on Thursday, when the incident ocurred.", "A newly married software engineer was killed, while his wife, mother and grandmother suffered injuries in an accident around midnight on Friday on Katraj –Dehu Road bypass in Balewadi after his car rammed into a stationary tempo from the rear.", "Eight people were injured after a BEST bus rammed into a car at Vashi.", "The incident occurred at the Arenja Corner junction around 7.30am, when the BEST bus from Kalamboli going towards Ghatkopar was heading to Shivaji Chowk after dropping commuters at the APMC market bus stop.", "A 24-year-old man was killed after being hit by a car near Tata Housing Company on Sohna Road late on Thursday.", "Two nilgais were killed on Pali Road near Asola Bhatti Wildlife Sanctuary in Faridabad after being hit by a car on Sunday morning.", "In yet another road accident on the Outer Ring Road (ORR), a Tata Consultancy Services (TCS) employee died while his colleague suffered serious injuries while they were travelling in a car between Tukuguda and Ravirala on Sunday.", "In another case, a three-year-old boy died when the car in which he was travelling with his parents, was hit by an RTC bus at Burlagate, Shadnagar on Sunday.", "Five persons were injured in two separate road accidents in Batala on Sunday.", "Two youth on a bike were hit by an over speeding car near Adda Leel Kala in Qadiyab area.", "In another accident that took place in Chaudhariwal area, three persons including a 10-year-old boy were injured.", "Three individuals were injured in separate road accidents that occurred in the city last week.In the first incident, a 21-year-old was coming from Pune to Thane with her father when their four-wheeler met with an accident.", "A speeding milk van rammed into their car on Saturday near Kalwa Hospital.", "In another incident, a motorcycle-born couple suffered grievous injuries after a bike hit them from behind near the Cadbury junction, last week.", "Three persons, including a truck driver and a biker, were killed in two separate accidents in Noida within a span of few hours.", "While two men were killed on the Noida-Greater Noida expressway on Sunday night when a truck lost its balance due to tyre burst, a biker died in a road accident near Film City on Monday morning.", "A third accident was reported on Monday morning when a UP Roadways bus hit a divider in Sector 56 and two passengers recieved minor inuries.", "The expressway accident happened on Sunday night when a potato-laden truck travelling from Aligarh to Delhi’s Azadpur Mandi rammed two trucks parked near Mahamaya flyover around 11pm.", "The other accident took place near Film City that claimed the life of a 44-year-old biker, Abdul Sayeed, when his bike lost balance and hit a divider around 10am on Monday.", "In another accident, two passengers received minor injuries on Monday when a Roadways bus travelling to Hapur hit the divider near Hotel Park Plaza in Sector 56 around 6am.", "A 33-year-old private company executive was killed outside his apartment in Ghaziabad when a speeding car hit him in the early hours of Sunday.", "Mohit Chatwal, a resident of Ajnara Integriti apartments in Raj Nagar Extension, was working with a Delhi-based event and execution firm as operations manager.", "The incident took place just in front of the society around 12.15am on Sunday.", "A leopardess was fatally knocked down by an unidentified vehicle at Moolehole range inside Bandipur National Park.", "A speeding police patrol Gypsy rammed a three-wheeler at Janpath on Tuesday afternoon, critically injuring its 60-year-old driver.", "Eyewitnesses said the auto-rickshaw overturned after being hit from behind by the Gypsy around 12.30pm.", "A traffic constable attached to the Palaspe unit of the state highway safety patrol went out of his line of duty to trace a car that had mowed down a woman ragpicker, while she was crossing the Mumbai-Pune Expressway near Panvel exit.The incident occurred on May 24 morning near Kon village where Ranjana Shaikh (45) was hit by a speeding car.", "Shaikh was killed on the spot.", "A 16-year-old schoolgirl was killed in a hit-and-run accident in Ghaziabad while returning home with a friend on her scooter from school on Tuesday.", "The accident happened around 11am near Mangal Chowk, a few metres away from the main gate of Lane 2 of Niti Khand 1 where it connects with the main road.", "Two girls died after a speeding car rammed into their scooter and run them over outside their college in Chaksu on Tuesday morning.The accident took place at Chakshu Bypass on Namodia Road at 9.30 AM when Suman Sahu(21) and Puja Sawaria (22) were heading to their college in Chakshu when a car rammed their scooter from behind.", "At least 14 persons were injured when a Gujarat State Road Transport Corporation (GSTRC) bus veered off the road in the hilly area between Navavas and Dhundhiya village near Danta on Tuesday.",
"A 24-year-old tempo driver suffered head and leg injuries in an accident on the Majiwada bridge on Wednesday morning.",
"In another incident, a 30-year-old driver with the MSRTC was arrested by the Kapurbawdi police for drunk driving following a random checking of the Nalasopara-bound bus by the patrolling unit on Ghodbunder Road late on Tuesday.",
"A 40-year-old woman was killed in a hit-and-run accident on NH-58 bypass in Ghaziabad on Wednesday while she was riding her scooter on her way home.",
"Two minor siblings died and their mother was seriously injured when a speeding bus hit them in Badalpur on Tuesday night.",
"The two children received critical injuries and died on the spot.",
"Five persons including four police officers were injured when a speeding Maruti Eeco car crashed into a PCR van in Dadri on Tuesday night.",
"The accident occurred at G T Road in Dadri when the PCR was on a patrolling duty.",
"Police said the accident occurred around 10pm at Chithera village.",
"Police suspect a suicide pact led to the death of three members of a family whose charred remains were found in a car near Kancheepruam on Saturday night.",
"A 36-year-old man was killed and two others were injured after the private bus they were traveling in rammed a truck on L&T Bypass Road here on Wednesday afternoon.",
"Earlier this week, nearly 18 passengers were injured after a bus belonging to Kallada Travels collided with a truck near Karumathampatty.",
"A woman identified as Tarlika died near Gadheda Market in Kishanwadi after an unidentified car driver hit her on Thursday morning.",
"In another incident, Naresh Vasava, a resident of Por, died after an unidentified commuter hit him on Nareshwar-Palej Road on Wednesday.",
"A 30-year-old man died after a Celerio car rammed his bicycle from behind in southwest Delhi's Dwarka on Wednesday evening.",
"The incident was reported at 7.30pm after which a police team rushed the injured to a hospital.",
"Another fatal accident was reported in Dwarka in which a car rammed another.",
"The incident was reported at 10pm on Tuesday when a Santro was hit by another car while it was crossing a traffic signal.",
"Four persons, including a six-year-old boy, died in a head-on collision between two motorcycles on Thursday at Longiwind village of Moga.",
"Three persons sustained injuries.",
"Vithu Betkikar, 60, from Kulkarniwada in Betki, died on Friday morning when the scooter he was riding was hit by an oncoming car at Mardol, Ponda.",
"Another scooterist, 32-year-old Maruti Polekar from Usgao, too, was knocked down in the accident and severely injured.",
"A fishing trip to Kurdi proved costly for 80-year-old Navidade Antonio Fernandes on Friday.",
"Fernandes died on the spot.",
"Four persons, including two children, were killed and 10 others critically injured after the multi utility vehicle in which they were travelling met with an accident on the Pune-Mumbai expressway at Aundhe village on Saturday noon.",
"Bettiah chief judicial magistrate (CJM) Jairam Prasad was injured after his SUV collided with a truck on SH-74 near Abuchak under the Saraiyya police station area in Muzaffarpur district on Saturday.",
"The accident took place at 5.30am when the CJM was travelling to Patna from Bettiah and his vehicle collided with a truck coming from the opposite direction.",
"An auto-driver Mahantraj Thakur, 48, a resident of CTM, was run over by a speeding mini-truck near Hatkeshwar Circle on Saturday morning",
"Police said a mini-truck rammed into Thakurs auto near Hatkeshwar Circle.",
"Two persons have died in separate road accidents in Rajkot.",
"In the first incident, an autorickshaw driver was killed when he rammed into a parked truck from the rear in Navagam area on Thursday night.",
"In the second incident, a 70-year-old man died after his bike had a head on collision with another bike.",
"Three Malayalis were killed in a road accident at Dhalam near Mecca on Friday.",
"The accident occurred at Riyadh-Taif Express Highway when the vehicle in which they were travelling hit another car and turned turtle.",
"Four others Taif, Munavar, Aboobaker, his wife Sajida and son Muhammed (all hailing from Pattambi)  were also injured in the accident.",
"A new mother returning home in an ambulance with her two-day-old daughter after being released from hospital had a close shave when a mini truck that skipped a traffic signal on Mayo Road and crashed into the ambulance on Red Road on Sunday afternoon.",
"The impact left the father of the woman severely injured and the two drivers bleeding and bruised.",
"The incident happened around 1.45pm when Banerjee was heading towards her home at Domjur in Howrah",
"In a tragic incident, three of a family including two women and a toddler drowned when the car they were travelling plunged into a canal at Puthanvelikkara, North Paravoor, near here on Saturday late night.",
"A 21-year-old motorcyclist was fatally knocked down by a truck while his colleague, who was riding pillion, sustained serious injuries in a hit-and-run accident near Megapolis City in Hinjewadi phase-II early on Saturday.",
"A 25-year-old man died and another person was injured after their scooter slipped into a drain and the cement pillar on its boundary hit the drivers head.",
"The incident was reported from south Delhis Vasant Kunj on Sunday evening.",
"Tragic accident reported at Nhaibag-Pernem along the national highway 17 on Sunday claimed two lives from the same family (father and son).",
"Police said that the accident was reported at around 10.15 am",
"A new mother returning home in an ambulance with her two-day-old daughter after being released from hospital had a close shave when a mini truck that skipped a traffic signal on Mayo Road hit the ambulance on Red Road on Sunday afternoon.",
"22 people were charred to death and another 15 received serious burns after a bus caught fire in a bus-truck collision near Invertis university under Bithri Chainpur police station on the intervening night of June 4-5.",
"A car rammed into another car near the Airport grievously injuring four passengers late on Sunday.",
"The incident happened at around 6.30 pm and the injured were rushed to LF hospital Angamaly.",
"Two people, including a retired TNSTC employee, were killed and 15 injured in two separate road accidents near Manapparai on Saturday.",
"According to police, a group of 10 people were going towards Chennai from Sivakasi in a car to attend a marriage on Saturday night.",
"While they were approaching Thuvarankuruchi in Trichy around 1am on Sunday, the car rammed into the centre median at Kalluppatti.",
"In another incident, Murugesan, 45, a car driver from Mathulampettai in Kumbakonam, died on the spot and six others were injured when their vehicle collided with another car.",
"Death of a couple following road mishap triggered mob fury at Pipili, about 25 km from,here, as irate locals set afire three buses on Monday.",
"Although Singh survived with a fractured leg, his six relatives died in the fire.",
"A 16-year-old girl was run over by a speeding car in Sabarmati on Sunday evening.",
"In another incident, two persons from Chandkheda were reported dead after their motorcyle was hit by a dumptruck near Zundal on Sunday.",
"When they were passing near Raghav Farm on the Adalaj-Ahmedabad road, a dumptruck hit their motorcycle when trying to overtake them.",
"A jain lady monk was killed after her wheelchair was hit by a speeding car on a road near Vallabhipur village in Bhavnagar district on Monday morning.",
"The accident occurred at around 4 am.",
"In a tragic road accident on Sunday afternoon, three members of a family, including a five-month-old girl, were killed, while two others were grievously injured.",
"At around 4:00pm, he reached the NSG campus near NH8, when a Rajasthan roadways bus coming from the Jaipur side lost control and jumped the divider.",
"In another tragic accident, five members of a family died when the SUV in which they were travelling collided with a truck parked by the highway on national highway (NH) 24 under Mudhapandey police station area of Moradabad, around 5.30 am on Monday.",
"wo bike-borne youths were killed on the spot on Monday evening after their bike collided head-on with a pick-up vehicle that came from the wrong side on Kota-Jaipur National Highway near Ramganjbalai village under Sadar police station area in Bundi city.",
"Two persons died in a road accident late on Sunday night in Shivdaspura area of the city.",
"Five persons were on Tuesday killed when an overloaded truck tipped over and crushed their car near Chomu House Circle in the city.",
"The accident happened at around 4 am today.",
"A five-year-old girl died when an RTC bus rammed into a car on Tuesday morning at Kandiguda gate.",
"Members of the public apprehended a Rajasthan registered vehicle and thrashed its driver for trying to escape after colliding with a two-wheeler and injuring its rider, at Panaji, on Tuesday afternoon.",
"Police said the vehicle was proceeding towards Miramar when it hit a two-wheeler while attempting to overtake it near the ferry point.",
"Five persons died, including a recently engaged couple, after an overloaded truck overturned and fell over their car in the wee hours of Tuesday near Chomu Circle area of the city.",
"The traffic police said that incident took place at 4 am in the morning.",
"Two people died and seven others were injured after a Safari car allegedly hit a motorcycle in Barkhera village in Madnapur block of Shahjahanpur district.",
"The accident took place when a group of seven people travelling in the Safari car were on their way back to Kanpur from Haridwar on the Shahjahanpur-Farukkhabad highway on Sunday midnight, when a motorcycle with two people astride suddenly came before the Safari from a Barkhera village link road.",
"Around 15 students of the Santa Maria Senior Higher Secondary School in Mundamveli had a narrow escape on Tuesday morning when one of the tyres of the school bus they were travelling came off.",
"The incident happened at around 7.30 am at Cheriya kadavu on Thoppumpady-Chellanam road.",
"The Jaipur police on Wednesday arrested the driver and the helper of the truck that killed five persons after it overturned and fell on a car near Chomu Circle area of the city in the wee hours of Tuesday.",
"Three people were killed and eight injured after a vehicle they were travelling in skidded of the road and fell into an 80-metres-deep ditch in Almora district on Wednesday.",
"The accident occurred at 9.30am near Genar village in Bhasiyachana of Almora district.",
"A 45-year-old tempo owner was crushed by a speeding truck near a police checkpost on Wazirabad Road in north Delhi on Thursday night.",
"Two separate road accidents in the district left 58 passengers injured.",
"A passenger van tail-ended a lorry injuring 22 passengers in the van injured near Manapparai late on Thursday night while a private bus toppled near Natarajapuram injuring 36 passengers on Friday.",
"A van carrying 25 people from Sankari in Tirunelveli district met with the accident when their vehicle hit a lorry near Adhikaram on the Madurai- Trichy national highway late on Thursday.",
"An employee of a software company and a criminal on police record were killed in a head-on collision between two motorcycles late on Tuesday night at Ganapati Matha in Warje, while a pillion rider suffered serious injuries.",
"A 27-year-old BTech student of African origin died in an accident after losing control of a Honda Accord car in Greater Noida early on Thursday morning.",
"Two people were killed in two road accidents in Kolhapur on Friday evening.",
"A 52-year-old woman was killed when a Kolhapur Municipal Transport (KMT) bus ran over her at Gangavesh area, as she was crossing the road.",
"In another accident, a 35-year-old man sustained head injuries when his motorcycle skidded while he was taking a sharp turn on Kolhapur-Panhala road, near Kerli village.",
"At least two persons were killed and 10 others seriously injured when a bus they were travelling in collided with a stationary truck on Patna-Bakhtiyarpur NH-30 near Majhauli village under Salimpur police station in the district on Friday.",
"A 40-year-old woman and her eight-year-old son were killed after a mini bus collided with the Alto in which they were travelling along the Mumbai-Goa (NH66) highway.",
"The fatal mishap occurred on Friday around 6.45 pm when the car was travelling towards Mumbai and had reached near Chandhave-Budruk village in Mahad taluka.",
"Two youths were killed when the truck they were in collided with the wall of an underpass in Dadri on Friday.",
"A couple and their 22-year-old son were killed while their younger son suffered injuries after their car hit a divider on National Highway 1 near Khanpur Kohlia village on Friday.",
"A tragedy was averted following swift action by passers-by as a car plunged into the Chambakkara canal near Kundanoor on Friday afternoon.",
"The incident happened near Kannaadikaadu.",
"Three members of a family, including a toddler, were killed when the car in which they were travelling plunged in to a canal at Puthenvelikkara near here on Saturday night.",
"A 45-year-old tempo owner was crushed by a speeding truck near a police checkpost on Wazirabad Road in north Delhi on Thursday night.",
"Eight persons were killed and two others injured on Saturday when an auto rickshaw carrying passengers collided head-on with a Hyva truck on Balikuda-Jagatsinghpur road near Itapada in Jagatsinghpur district.",
"One person was killed and 19 injured after a bus overturned near Manota bridge in Sambhal on Thursday morning.",
"The bus overturned around 8 in the morning.",
"Twenty-one passengers of the UPSRTC bus died in a fire after an accident on NH-24 near Bareilly city on the night of June 5.",
"Zaira Wasim, a Kashmiri actor who was seen in Aamir Khan's blockbuster movie \"Dangal\", was miraculously rescued by locals here after her car fell into the Dal Lake on Thursday.",
"Two teenagers who were on a bike died after a \"speeding\" public transport bus brushed past their two-wheeler on the old Mumbai-Pune highway on Friday.",
"Traffic came to a halt on NH-8, near Krishnanagar on Friday night as two luxury buses, a truck and a jeep collided with each other injuring 10 persons.",
"A full-grown female leopard was killed in a hit-and-run accident on Mul Road, around 15km from Chandrapur, near Chichpalli village on Saturday.",
"A 24-year-old BTech student was killed after being hit by an allegedly speeding Hyundai Accent car in southwest Delhi's Dwarka on Friday afternoon.",
"A Visakhapatnam-bound private travels bus carrying 36 passengers overturned after ramming an electric pole at Gajulapalle near Ibrahimpatnam on Saturday.",
"The accident occurred at 3 am.",
"Ten people including five women were killed when the Innova car they were travelling in plunged into Fatehpur Sikri canal in Mathura around 4 am on Sunday.",
"At least two persons were killed and 10 others seriously injured when a bus they were travelling in collided with a stationary truck on Patna-Bakhtiyarpur NH-30 near Majhauli village under Salimpur police station in the district on Friday.",
"A man died after a four-wheeler hit his bike at Mauaima-Kalandarpur Road in the trans-Ganga area of Mauaima on Saturday.",
"A 24-year-old BTech student was killed after being hit by an allegedly speeding Hyundai Accent car in southwest Delhis Dwarka on Friday afternoon.",
"A 65-year-old man succumbed to his injuries after a truck hit him on Sohna road.",
"According to Rajkumar, a truck coming from Nuh suddenly took a turn near Indri Mod and ran over Singh's leg.",
"The deceased met with the accident on Wednesday morning.",
"A thanksgiving pilgrimage to Mehndipur Balaji temple in Dausa, Rajasthan ended in tragedy for nine members of a Bareilly family, who were killed along with the driver of their vehicle when it plunged into a canal in Mathura in the early hours of Sunday",
"A 23-year-old trainee naval officer died while his four colleagues sustained critical injuries when the car they were travelling in hit an electricity pole and a boulder along the Dolphin Hills ghat road falling under Malkapuram police station limits.",
"The incident occurred in the early hours of Saturday, but it came to light on Sunday after one of the injured Amandeep Singh registered a complaint with the police.",
"Two people suffered injuries in a road accident under Nakkapalli police station limits on Sunday when the motorbike on which they were travelling hit an autorickshaw.",
"The incident happened when they were going home at 2.15 pm on Sunday after completing their duties, sub-inspector L Ramakrishna to TOI.",
"Three persons died after a bus rammed into a truck on the Delhi-Jaipur highway near Kotputli early Sunday morning",
"Police said that as many as 18 people were injured in the accident and undergoing treatment.",
"The incident took place near the Panchredi village in Kotputli.",
"The driver of a speeding car escaped with injuries after his vehicle dashed against a steel crash barrier that broke and pierced through the four-wheeler at Kamshet on the Pune-Mumbai expressway around 5pm on Sunday.",
"A 28-year-old driver and 22-year-old helper of a trailer truck that they were driving were killed on Sunday early morning after the vehicle lost balance and fell into a deep gorge on National Highway 52.",
"The incident occurred near Badanayagaon village under Hindoli police station area of Bundi district.",
"A trailer truck, loaded with iron rods on Sunday morning around 6.15 am, while coming from Jaipur to Kota, fell into a deep gorge on National Highway 52 near Badanayagaon village.",
"Three people, including a couple, died, while three others were injured in two accidents in the southern districts on Sunday.",
"In an accident near Oddanchatram in Dindigul district, a couple were killed and their children, aged 6 and 8, injured after their van collided head-on with a government bus on Sunday morning.",
"Meanwhile, a 45-yearold man died, while his daughter suffered injuries when the two-wheeler on which the duo was travelling rammed a truck from behind, near Tuticorin on Sunday morning.",
"One person was killed and 27 others sustained critical injuries, when a truck they were travelling in, overturned in Sonkatch area of Dewas district in wee hours of Monday.",
"The accident took place around 1am when the truck carrying people from Obedullahganj near Bhopal, overturned near Guru Kripa dhabha",
"An accident between a car and a motorbike on Monday noon snowballed into a major law and order situation in Raebareli district after the car owner opened fire, killing one of the bike riders.",
"A 22-year-old man lost his life after a car, attempting to overtake another vehicle, rammed into the two-wheeler he was riding late Sunday evening at Sancoale.",
"The incident occured at around 9.20pm, when the deceased Mangor Hill resident Vasudev Rajappa Sajjal Gauda, was traveling on his two-wheeler from Vasco towards Panaji.",
"Two persons were charred to death in a car when it rammed into a moving mini truck near Gundlaw crossroad in Valsad.",
"An engineering student from Jammu died in a road accident in Pathankot on Sunday evening.",
"The car lost its control near Damtaal and rammed into a divider.",
"One person died and 21 others were seriously injured after a truck lost control and rammed into multiple vehicles at a bus stand on Jaipur-Delhi national highway in Virat Nagar on Monday morning.",
"The incident took place at 9.30 AM when a truck reportedly lost control and rammed into taxis and cars at the bus stop, 25year-old Arvind, a resident of Virat Nagar died on the spot.",
"Three persons including a pregnant woman were killed in a road accident near Thalaivasal in Salem district on Monday.",
"The accident happened at Koot Road area check post near Thalaivasal on Salem-Chennai national highway.",
"Four persons were killed and one critically injured after the jeep they were travelling in lost control and rammed into a tanker on the National Highway-8 near Parai village under Parsad police station.",
"The incident took place around 11 am when the five men were going to their place of work.",
"A 10-month-old boy and a private firm employee were killed in two separate accidents since early Tuesday morning.",
"The first accident occurred in west Bengaluru around 5.30am.",
"A speeding truck rammed a two-wheeler near Sunkadakatte, Magadi Road, killing 10-month-old Bharath who was travelling with his parents.",
"The second accident was reported around 6pm near TVS Cross, near Jalahalli Cross, when a speeding car hit a two-wheeler and a goods autorickshaw before coming to a halt.",
"Four people were killed in separate accidents that happened over the last two days.",
"Seventeen-year-old Mohit, who was riding pillion with his uncle, Kulraj (24), met with an accident on Monday evening when a speeding Silver coloured Ritz rammed head-on into their near Hailey Mandi.",
"In another incident, a 32-year-old man was killed after pick-up truck crashed into his bike.",
"Another person was killed after meeting with an accident on Sunday evening with a tractor carrying iron rods.",
"Three persons died in two separate accidents in Vadhvan and Jamnagar.",
"In the first accident, a car driver lost control and rammed his vehicle into a parked truck on Limdi-Bagodara highway near Mithapur village.",
"In the second accident, four-year-old boy Vikas Vala, died after a tractor ran over him in Jamnagar.",
"A 38-year-old woman on Wednesday succumbed to the severe head injuries she suffered after falling off the bike on a speed breaker in Adajan on June 1.",
"He jumped the speed breaker and met with the accident near Savani Road.",
"The accident happend immediately after they crossed the Makkai Pul.",
"Two KSRTC buses collided head-on at Perumbavoor on Wednesday morning injuring 20 persons.",
"The incident involving a Venad bus on its way to Aluva and a superfast in the opposite direction happened in the Aluva-Perumbavoor route.",
"The accident spot at Manjapetti had a deadly curve and the buses were speeding.",
"The incident took place on the night of June 11, when 23-year old Mohan Sahni, a mason, was going from Samastipur in Bihar to Ludhiana in Amrapali Express.",
"At least eight persons were killed while 30 other suffered injuries when a Gorakhpur bound UP State Road Transport Corporation (UPSRTC) bus fell into a ditch after breaking the railing of the bridge on Sai river in Sikrara area of Jaunpur district on Wednesday afternoon.",
"Ten pilgrims were killed and 55 were injured when a bus carrying them to key shrines in Himachal Pradesh went off the road at a blind curve at Dhaliara village in Kangra district on Thursday.",
"Five people were killed in as many hit-and-runs in Mohali district on Wednesday.",
"Parwinder Singh, a resident of Ambala, was on way home along with his friend, Shubneet Singh, when a truck rear-ended their bike near Handesra village, Derabassi, at 3.40pm.",
"In the second such incident, a 29-year-old man was killed after an SUV rammed into his auto-rickshaw near the Sohana gurdwara around 8pm.",
"Santosh Kumar, a resident of Zirakpur, was crossing a road after buying medicines when a car ran into him at Patiala chowk, killing him on the spot.",
"Two persons have died in separate hit-and-run incidents in the city.",
"In the first incident, 55-year-old Vijay Khodankar was rushed to Mayo hospital after his bike was hit by a truck (MH31 EC 7861) near Kalamna market on Wednesday.",
"Earlier on Wednesday, 27-year-old Shailesh Gaidhane was killed after his bike was hit by an unknown load carrier on Wardha road when he was returning from Dongargaon.",
"Discus thrower Seema Punias husband and coach Ankush Punia was on Thursday seriously injured in a road accident on Meerut-Delhi-Dehradun highway after a UP roadways bus hit his motorcycle from behind in the district.",
"An elderly woman, the mother of a senior IAS officer, was mowed down by a speeding car near Chanakyapuri on Thursday night.",
"A car hit her while taking a right turn on Madhu Limaye Marg.",
"Two passengers were killed and 12 critically injured after a packed Sealdah-bound minibus fell on its left side at the foot of the Kolkata-end of Howrah bridge on Friday morning.",
"Two persons were killed and 18 sustained injuries when a private bas rammed into a wall of a bridge near Bardoli in Surat district in the wee hours of Friday.",
"A 31-year-old BTech graduate hailing from Warangal was killed in a road mishap in Riyadh, Saudi Arabia, after the front tyre of the car he was travelling in burst.",
"A 25-year-old man was crushed under the wheels of a UP Roadways bus in Dadri on Friday.",
"Two persons had a narrow escape after the truck they were travelling in fell into a 60-ft-deep gorge at Dimbam ghat section on Tamil Nadu  Karnataka national highway on Friday.",
"Sixteen people were injured in Noida in two separate road accidents on Saturday.",
"The first accident occurred at 6.15 am when a bus carrying workers of a private company overturned near the Sector 57 intersection after it was hit by another bus, which had no passengers, coming from Khoda Colony.",
"In another accident, a mini truck (canter) overturned near the Sector 16A flyover when the driver failed to negotiate a turn.",
"The accident occurred around 7am.",
"A crane driver and his assistant identified as Shamimullah Ansari and Brijesh Yadav died in the wee hours of Saturday near Jambuva bridge on national highway-8 after the crane rammed into a truck due to rash driving of a private luxury bus driver which was beside the crane.",
"Three persons were killed and four injured when the bikes they were travelling on had a head-on collision with a truck in Rajula on Saturday morning.",
"The accident occurred at Charnala area near Rajula.",
"One person died on the spot and three others suffered serious injuries when the car in which they were travelling rammed an oncoming truck at Sriparru in West Godavari district on Saturday.",
"The incident happened at around 6 am.",
"Four persons died after an overloaded truck lost control and collided with their car near Kathuwas bus stand on Rewari- Narnaul in Alwar on Saturday morning.",
"Two constables were injured when their vehicle was rammed by a speeding cluster bus near Janpath on Sunday afternoon.",
"In yet another accident on Durgapur Expressway , three members of one family were killed in an accident on Sunday morning after the car in which they were travelling rammed into a stationary truck.",
"Four persons were killed and nine injured in a head on collision between a Multi Utility Vehicle and a truck on Malsian-Lohian road on Sunday afternoon.",
"One man was killed and six injured when a tractor and a double-decker tourist bus collided near HRIT College in Muradnagar on Monday.",
"Three tourists from Mandawa near Mumbai and a driver were injured when the car they were travelling in fell into a gorge at Rahni nullah about 5km from the Rohtang Pass on Monday.",
"Two people, including a woman, lost their lives in separate hit-and-run accidents that took place in Sohna and Bilaspur areas on Sunday.",
"The first accident took place near Lakhuwas village on Sohna road, near the Reliance petrol pump, on Sunday evening.",
"The second accident took place on the Sidhrawali flyover on NH 8 on Sunday night, when a speeding Tata Sumo hit a pedestrian, Ravinder (33), who died on spot.",
"A software engineer from a prominent IT company in Magarpatta died of multiple injuries while his colleague, also a techie, sustained a fractured leg when their motorcycle crashed into a low median on Magarpatta Road near Laxmibai Magar School in Hadapsar around 3am on Sunday.",
"Four people, including the groom were killed late on Sunday evening when a car in which they were travelling was hit by a speeding SUV in Rawatsar area of Hanumangarh district.",
"The accident took place around 8pm on Sunday.",
"Four people had died and three others were injured on the wee hours of Sunday when a truck collided with a car near Hanumangarh junction."
]